# HydraulicSeparationOfOneSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..HydraulicSeparationOfOneSystem Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
Unable to hydraulically separate the loop when both supply and return are assigned to the same system. Try again with both start and end selected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HydraulicSeparationOfOneSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HydraulicSeparationOfOneSystem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HydraulicSeparationOfOneSystem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace